In [111]:
import pandas as pd

In [112]:
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type:', type(titanic_df))
titanic_df.head()

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,...,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",...,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",...,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",...,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",...,373450,8.0500,NaN,S

In [113]:
print('DataFrame 크기 :', titanic_df.shape)

DataFrame 크기 : (891, 12)

In [114]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [115]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [116]:
import numpy as np

In [117]:
col_name1 = ['col1']
list1 = [1,2,3]
array1 = np.array(list1)
print('array1 shape:',array1.shape)

array1 shape: (3,)

In [118]:
df_list1 = pd.DataFrame(list1, columns= col_name1)
print('1차원 리스트로 만든 DataFrame:\n',df_list1)

1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [119]:
col_name2 = ['col1','col2','col3']
list2 = [[1,2,3],
         [11,12,13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape)

array2 shape: (2, 3)

In [120]:
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame: \n', df_list2)

2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [121]:
df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n',df_array2)

2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [122]:
dict ={'col1':[1,11],'col2':[2,12],'col3':[3,13]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n',df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [123]:
array3 = df_dict.values
print('df_dict.values 타입 :',type(array3),'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입 : <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 12 13]]

In [124]:
list3 = df_dict.values.tolist()
print('df_dict.values.tolist()타입 :',type(list3))
print(list3)

df_dict.values.tolist()타입 : <class 'list'>
[[1, 2, 3], [11, 12, 13]]

In [125]:
dict3 = df_dict.to_dict('list')
print('df_dict.to_dict() 타입: ',type(dict3))
print(dict3)

df_dict.to_dict() 타입:  <class 'dict'>
{'col1': [1, 11], 'col2': [2, 12], 'col3': [3, 13]}

In [126]:
pd.options.display.max_columns=8
titanic_df['Age_0'] = 0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,...,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",...,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",...,7.9250,NaN,S,0

In [127]:
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No']= titanic_df['SibSp'] +titanic_df['Parch']+1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,...,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",...,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",...,S,0,260.0,1

In [128]:
titanic_df['Age_by_10'] += 10 
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,...,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",...,S,0,230.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,C,0,390.0,2
2,3,1,3,"Heikkinen, Miss. Laina",...,S,0,270.0,1

In [129]:
titanic_drop_df = titanic_df.drop('Age_0',axis = 1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,...,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",...,NaN,S,230.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,C85,C,390.0,2
2,3,1,3,"Heikkinen, Miss. Laina",...,NaN,S,270.0,1

In [130]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,...,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",...,S,0,230.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,C,0,390.0,2
2,3,1,3,"Heikkinen, Miss. Laina",...,S,0,270.0,1

In [131]:
drop_result = titanic_df.drop(['Age_0','Age_by_10','Family_No'], axis = 1, inplace = True)
print('inplace = Ture로 Drop 후 반환된 값:', drop_result)
titanic_df.head(3)

inplace = Ture로 Drop 후 반환된 값: None

,PassengerId,Survived,Pclass,Name,...,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",...,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",...,STON/O2. 3101282,7.9250,NaN,S

In [132]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('### before axis 0 drop ###')
print(titanic_df.head(3))

titanic_df.drop([0,1,2], axis = 0 , inplace=True)
print('### after axis 0 drop ###')
print(titanic_df.head(3))

### before axis 0 drop ###
   PassengerId  Survived  Pclass            Name  ...          Ticket     Fare  Cabin  Embarked
0            1         0       3  Braund, Mr....  ...       A/5 21171   7.2500    NaN         S
1            2         1       1  Cumings, Mr...  ...        PC 17599  71.2833    C85         C
2            3         1       3  Heikkinen, ...  ...  STON/O2. 31...   7.9250    NaN         S

[3 rows x 12 columns]
### after axis 0 drop ###
   PassengerId  Survived  Pclass            Name  ...  Ticket     Fare  Cabin  Embarked
3            4         1       1  Futrelle, M...  ...  113803  53.1000   C123         S
4            5         0       3  Allen, Mr. ...  ...  373450   8.0500    NaN         S
5            6         0       3  Moran, Mr. ...  ...  330877   8.4583    NaN         Q

[3 rows x 12 columns]

In [133]:
titanic_df = pd.read_csv('titanic_train.csv')
indexes = titanic_df.index
print(indexes)
np.set_printoptions(threshold=100, edgeitems=36)
print('Index 객체를 실제 값 array로 변환')
print('Index 객체 array 값: \n',indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index 객체를 실제 값 array로 변환
Index 객체 array 값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
 ... 855 856 857 858 859 860 861 862 863 864 865 866 867 868 869 870 871
 872 873 874 875 876 877 878 879 880 881 882 883 884 885 886 887 888 889
 890]

In [134]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [135]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입:', type(value_counts))
new_value_counts = value_counts.reset_index(inplace = False)
print(new_value_counts)
print('new_value_count 객체 변수 타입', type(new_value_counts))

### before reset_index ###
Pclass
3    491
1    216
2    184
Name: count, dtype: int64
value_counts 객체 변수 타입: <class 'pandas.core.series.Series'>
   Pclass  count
0       3    491
1       1    216
2       2    184
new_value_count 객체 변수 타입 <class 'pandas.core.frame.DataFrame'>

In [136]:
print('단일 칼럼 데이터 추출: \n', titanic_df['Pclass'].head(3))
print('\n여러 칼럼의 데이터 추출:\n', titanic_df[['Survived','Pclass']].head(3))
#print('[]안에 숫자 index는 KeyError 오류 발생: \n', titanic_df[0])

단일 칼럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 칼럼의 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

In [137]:
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name  ...     Ticket     Fare  Cabin  Embarked
0            1         0       3  Braund, Mr....  ...  A/5 21171   7.2500    NaN         S
1            2         1       1  Cumings, Mr...  ...   PC 17599  71.2833    C85         C

[2 rows x 12 columns]

In [138]:
titanic_df[titanic_df['Pclass']==3].head(3)

   PassengerId  Survived  Pclass            Name  ...          Ticket   Fare  Cabin  Embarked
0            1         0       3  Braund, Mr....  ...       A/5 21171  7.250    NaN         S
2            3         1       3  Heikkinen, ...  ...  STON/O2. 31...  7.925    NaN         S
4            5         0       3  Allen, Mr. ...  ...          373450  8.050    NaN         S

[3 rows x 12 columns]

In [139]:
data = {'Name':['Chulmin','Enukyung','Jinwoong','Soobeom'],
        'Year':['2011','2016','2015','2015'],
        'Gender':['Male','Female','Male','Male']}
data_df = pd.DataFrame(data, index = ['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Enukyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [140]:
print('\n 맨마지막 칼럼 데이터 [:, -1] \n', data_df.iloc[:,-1])

 맨마지막 칼럼 데이터 [:, -1]
 one        Male
two      Female
three      Male
four       Male
Name: Gender, dtype: object

In [141]:
print('\n 맨마지막 칼럼을 제외한 모든 데이터 [:, :-1] \n', data_df.iloc[:,:-1])

 맨마지막 칼럼을 제외한 모든 데이터 [:, :-1]
            Name  Year
one     Chulmin  2011
two    Enukyung  2016
three  Jinwoong  2015
four    Soobeom  2015

In [142]:
print('위치기반 iloc slicing\n',data_df.iloc[0:1,0],'\n')
print('명칭기반 loc slicing\n', data_df.loc['one':'two','Name'])

위치기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

명칭기반 loc slicing
 one     Chulmin
two    Enukyung
Name: Name, dtype: object

In [143]:
pd.reset_option('display.width')
pd.reset_option('display.max_colwidth')
pd.set_option('display.max_rows',4)

titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,...,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",...,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",...,113509,61.9792,B30,C
...,...,...,...,...,...,...,...,...,...
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",...,113572,80.0000,B28,NaN
851,852,0,3,"Svensson, Mr. Johan",...,347060,7.7750,NaN,S

In [144]:
titanic_df[titanic_df['Age']>60][['Name','Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [145]:
titanic_df.loc[titanic_df['Age']>60, ['Name','Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [146]:
titanic_df[ (titanic_df['Age']>60 )& (titanic_df['Pclass']==1)& (titanic_df['Sex']=='female')]

,PassengerId,Survived,Pclass,Name,...,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",...,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",...,113572,80.0000,B28,NaN

In [147]:
titanic_sorted = titanic_df.sort_values(by = ['Name'])
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,...,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",...,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",...,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",...,C.A. 2673,20.25,NaN,S

In [148]:
titanic_sorted = titanic_df.sort_values(by = ['Pclass','Name'], ascending = False)
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,...,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",...,345777,9.5,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",...,A/5. 851,14.5,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",...,345778,9.5,NaN,S

In [149]:
pd.reset_option('display.max_rows')
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [150]:
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [151]:
titanic_groupby = titanic_df.groupby(by = 'Pclass')
print(type(titanic_groupby))

titanic_groupby=titanic_df.groupby(by = 'Pclass').count()
titanic_groupby

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

        PassengerId  Survived  Name  Sex  ...  Ticket  Fare  Cabin  Embarked
Pclass                                    ...
1               216       216   216  216  ...     216   216    176       214
2               184       184   184  184  ...     184   184     16       184
3               491       491   491  491  ...     491   491     12       491

[3 rows x 11 columns]

In [152]:
titanic_groupby = titanic_df.groupby(by = 'Pclass') [['PassengerId','Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [153]:
titanic_df.groupby('Pclass') ['Age'].agg(['max','min'])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [155]:
agg_format= {'Age':'max','SibSp':'sum','Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [157]:
pd.set_option('display.max_rows',None)
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  ...   False  False   True     False
1        False     False   False  False  ...   False  False  False     False
2        False     False   False  False  ...   False  False   True     False

[3 rows x 12 columns]

In [158]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [159]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,...,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",...,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",...,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",...,STON/O2. 3101282,7.9250,C000,S

In [160]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [161]:
def get_square(a):
    return a**2
print('3의 제곱은:', get_square(3))

3의 제곱은: 9

In [162]:
lambda_square = lambda x: x**2
print('3의 제곱은 :',lambda_square(3))

3의 제곱은 : 9

In [163]:
a = [1,2,3]
squares = map(lambda x: x**2,a)
list(squares)

[1, 4, 9]

In [164]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name','Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

In [165]:
titanic_df['Child Adult']= titanic_df['Age'].apply(lambda x: 'Child' if x <= 15 else 'Adult')
titanic_df[['Age', 'Child Adult']].head(8)

         Age Child Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [166]:
titanic_df['Age_cat']= titanic_df['Age'].apply\
(lambda x: 'Child' if x <= 15 else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Age_cat
Adult      786
Child       83
Elderly     22
Name: count, dtype: int64